Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [3]:
movies = pd.read_csv('movies.dat', sep='::', names = ['ID', 'Movie', 'Genre'], engine='python')
movies.head()

   ID                               Movie                         Genre
0   1                    Toy Story (1995)   Animation|Children's|Comedy
1   2                      Jumanji (1995)  Adventure|Children's|Fantasy
2   3             Grumpier Old Men (1995)                Comedy|Romance
3   4            Waiting to Exhale (1995)                  Comedy|Drama
4   5  Father of the Bride Part II (1995)                        Comedy

In [4]:
ratings = pd.read_csv('ratings.dat', sep='::', names = ['UserID', 'MovieID', 'Rating', 'Timestamp'], engine='python')
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [5]:
top_movie = ratings[ratings.Rating == 5].groupby('MovieID', as_index=False).count().\
sort_values(by='UserID', ascending=False).head(1).MovieID

In [6]:
movies[movies.ID == int(top_movie)]['Movie']

2789    American Beauty (1999)
Name: Movie, dtype: object

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
power = pd.read_csv('power.csv')

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [52]:
filtered_power = power[power.country.isin(['Lithuania', 'Latvia', 'Estonia'])][power.category.isin([4, 12, 21])]\
[power.year.isin([2005, 2006, 2007, 2008, 2009, 2010])]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.
/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [55]:
filtered_power['quantity'].sum()

240481.0

In [64]:
power[power.country.isin(['Lithuania', 'Latvia', 'Estonia'])][power.category.isin([4, 12, 21])]\
[power.year.isin([2005, 2006, 2007, 2008, 2009, 2010])]['quantity'].sum()

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.
/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

240481.0

In [67]:
power[(power.country.isin(['Lithuania', 'Latvia', 'Estonia'])) & (power.category.isin([4, 12, 21])) \
            & (power.year.isin([2005, 2006, 2007, 2008, 2009, 2010]))]['quantity'].sum()

240481.0

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [109]:
metals_price = pd.read_html('https://fortrader.org/quotes')[2]

In [111]:
metals_price['Last'].max()

2198.5

In [113]:
metals_price.sort_values(by='Last', ascending=False).head()

                          Type       Last    Chg.   Chg.%  Time
1    Палладий Цена на Палладий  2198.5000 -7.6500 -0.3500   NaN
2  Золото Цена золота на бирже  1582.2900  5.5200  0.3500   NaN
3      Платина Цены на платину   974.2000 -3.3000 -0.3000   NaN
0      Серебро Цена на серебро    17.9820  0.4390  2.5020   NaN
4      Медь Цена меди на бирже     2.5325 -0.0275 -1.0742   NaN